{
    "favouritePokémon": [
        {
            "pokémon": "Poochyena",
            "sprite": "/images/sprites/gen3/261.png",
            "reason": "It's a cute little pup."
        },
        {
            "pokémon": "Lotad",
            "sprite": "/images/sprites/gen3/270.png",
            "reason": "It's quintessential Pokémon: a cute blue amphibious creature with a lilypad on its head. And the shiny is really nice."
        },
        {
            "pokémon": "Hariyama",
            "sprite": "/images/sprites/gen3/297.png",
            "reason": "Hariyama was part of my first ever Gen 3 team and I love its design. It's a big sumo wrestler with enormous hands and a great ability in Guts (if you didn't want Thick Fat)."
        },
        {
            "pokémon": "Mawile",
            "sprite": "/images/sprites/gen3/303.png",
            "reason": "Mawile is based on a futakuchi-onna (or 'two-mouthed woman'), a type of Japanese monster with two mouths – a normal one located on the woman's face and a second one on the back of the head beneath the hair. You're not sure whether it's cute or scary as hell and I kinda like that."
        },
        {
            "pokémon": "Aggron",
            "sprite": "/images/sprites/gen3/306.png",
            "reason": "Aggron is like if Shredder from TMNT combined with a monster from Godzilla universe. In the absence of Rhydon in Ruby/Sapphire/Emerald, Aggron was king."
        },
        {
            "pokémon": "Camerupt",
            "sprite": "/images/sprites/gen3/323.png",
            "reason": "I never got to use Camerupt but it's such a cool Pokémon with decent offensive stats. Sadly, despite its appearance, its defensive stats weren't so great but it's a Fire/Ground camel!"
        },
        {
            "pokémon": "Grumpig",
            "sprite": "/images/sprites/gen3/326.png",
            "reason": "Grumpig is a cool design and yeah, it sucks offensively but it's a cheeky pig in purple and black colours and weird dance moves."
        },
        {
            "pokémon": "Cacnea",
            "sprite": "/images/sprites/gen3/331.png",
            "reason": "It's a cactus scarecrow which I think is a really cool design. Grass/Dark fits perfectly, even if it isn't the best dual type for resistances but whatever, it looks good and it'd scare me if I lived in Hoenn."
        },
        {
            "pokémon": "Claydol",
            "sprite": "/images/sprites/gen3/344.png",
            "reason": "There's just something about Claydol that I really like. It's based on the Shakōki-dogū—a from Japanese lore and its name comes from clay + doll, as well as having some design elements from a dreidel. It looks scary and I guess that's point so job done."
        },
        {
            "pokémon": "Milotic",
            "sprite": "/images/sprites/gen3/350.png",
            "reason": "A graceful sea serpent in contrast to Gyarados's monstrous design."
        },
        {
            "pokémon": "Shuppet",
            "sprite": "/images/sprites/gen3/353.png",
            "reason": "A cheeky shadow puppet, what's not to love?"
        },
        {
            "pokémon": "Glalie",
            "sprite": "/images/sprites/gen3/362.png",
            "reason": "It's Jason Voorhees but just his head and he's floating! So cool (no pun intended)!"
        },
        {
            "pokémon": "Salamence",
            "sprite": "/images/sprites/gen3/373.png",
            "reason": "God, I loved Salamence when I first got one. It was Gen 3's Dragonite analog (Dragalog? Dranalog? Draganolog?) and the design was so cool and worth the grinding to get."
        },
        {
            "pokémon": "Metagross",
            "sprite": "/images/sprites/gen3/376.png",
            "reason": "A giant steel spider? I'm not even into spiders like that but it's cool as heck and an amazing Steel type design. I've used Metagross in subsequent games and I can't wait to use one in Scarlet/Violet."
        },
        {
            "pokémon": "Regirock",
            "sprite": "/images/sprites/gen3/377.png",
            "reason": "ÜN ÜN ÜN ÜN ÜN ÜN ÜN ÜN!"
        },
        {
            "pokémon": "Regice",
            "sprite": "/images/sprites/gen3/378.png",
            "reason": "Arguably my favourite Regi for some reason. Maybe it's the crystalline design or the fact that I love Ice types because of their underdog status. Nowhere near the best Regi but my fave nonetheless."
        },
        {
            "pokémon": "Kyogre",
            "sprite": "/images/sprites/gen3/382.png",
            "reason": "The Water legendary GOAT (since Lugia's water typing got taken away from us). It's an absolute beast in every conceivable way and my #1 VGC legendary in Sword and Shield. And that's before we even go into the primals."
        },
        {
            "pokémon": "Groudon",
            "sprite": "/images/sprites/gen3/383.png",
            "reason": "The Ground legendary GOAT. It's an absolute beast in every conceivable way and my #2 VGC legendary in Sword and Shield. And that's before we even go into the primals."
        },
        {
            "pokémon": "Rayquaza",
            "sprite": "/images/sprites/gen3/384.png",
            "reason": "The Dragon/Flying legendary GOAT. It's an absolute beast in every conceivable way and a fantastic design. And that's before we even go into the Megas. My big Sky Noodle."
        },
        {
            "pokémon": "Deoxys",
            "sprite": "/images/sprites/gen3/386-normal.png",
            "reason": "I never got a legit one but I liked its various Formes. I have a plush now that I got at the Worlds 2022 pop up shop and it's cool."
        }
    ]
}