{
    "favouritePokémon": [
        {
            "pokémon": "Empoleon",
            "sprite": "/images/sprites/gen4/395.png",
            "reason": "I didn't put it on the front of an album cover for nothing. A Water/Steel Emperor penguin. What an awesome starter evolution."
        },
        {
            "pokémon": "Luxray",
            "sprite": "/images/sprites/gen4/405.png",
            "reason": "One of the best early route Electric Pokémon, especially because it's a physical Electric type and has Intimidate."
        },
        {
            "pokémon": "Floatzel",
            "sprite": "/images/sprites/gen4/419.png",
            "reason": "It's a cute otter/weasel, what more can I say?"
        },
        {
            "pokémon": "Spiritomb",
            "sprite": "/images/sprites/gen4/442.png",
            "reason": "Such an awesome design and a great typing in terms of resistances (until Fairy came in)."
        },
        {
            "pokémon": "Hippowdon",
            "sprite": "/images/sprites/gen4/450.png",
            "reason": "HIPPO! I prefer the female Hippowdon because they're grey. Gotta love dimorphism in Pokémon!"
        },
        {
            "pokémon": "Weavile",
            "sprite": "/images/sprites/gen4/461.png",
            "reason": "One of many Gen 1/2 evolutions and Sneasel deserved this. Weavile is super quick and, despite the less-than-ideal typing, it has some great moves"
        },
        {
            "pokémon": "Tangrowth",
            "sprite": "/images/sprites/gen4/465.png",
            "reason": "I love Tangrowth so much. It's my favourite Grass type. It's a big cuddly bulky Pokémon and those aren't easy to come by."
        },
        {
            "pokémon": "Magmortar",
            "sprite": "/images/sprites/gen4/467.png",
            "reason": "I love Tangrowth so much. It's one of my favourite Fire types with an incredible design. Is it Krusty the clown? Is it a cannon-armed flamethrower? Both, both is good."
        },
        {
            "pokémon": "Togekiss",
            "sprite": "/images/sprites/gen4/468.png",
            "reason": "I didn't get into Togekiss until Gen 8 VGC and wow, this thing is a tank. Just a great Pokémon with great stats and movepool to both pack a punch and support if necessary. And it's a flying egg with little feet!"
        },
        {
            "pokémon": "Glaceon",
            "sprite": "/images/sprites/gen4/471.png",
            "reason": "It looks like old Nicki Minaj which isn't actually a reason why I like it but I just wanted to mention that."
        },
        {
            "pokémon": "Rotom",
            "sprite": "/images/sprites/gen4/479.png",
            "reason": "Such a cool design, especially in its appliance forms. I like how it has a major role in the games since Gen 7 via the Rotom Phone"
        },
        {
            "pokémon": "Dialga",
            "sprite": "/images/sprites/gen4/483.png",
            "reason": "I grew to love Dialga in Gen 9 but whatever. It's huge, it eats hits for breakfast and it'll knock you down with a host of Dragon or Steel moves."
        },
        {
            "pokémon": "Heatran",
            "sprite": "/images/sprites/gen4/485.png",
            "reason": "A Fire/Steel type immune to Fire moves? Great move. And, like I told my partner, it looks like a poo with legs."
        },
        {
            "pokémon": "Cresselia",
            "sprite": "/images/sprites/gen4/488.png",
            "reason": "This crescent duck won't go down easy and that's why I love it."
        }
    ]
}