{
    "favouritePokémon": [
        {
            "pokémon": "Fuecoco",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Quaquaval",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Dachsbun",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Smoliv",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Squawkabilly",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Ceruledge",
            "sprite": "",
            "reason": "When they showed this Pokémon in the SV trailers, I was HYPED. The colours, the design, the swords. It was my kind of warrior and, even though I've used its counterpart in VGC (Armarouge), I love Ceruledge much more. I love that it has Flash Fire as an Ability, that Grass Tera baits it out and prevents it from sleep, and it has access to moves like Bitter Blade, Shadow Sneak, and Solar Blade. If anything, I wish it had Sharpness as a Hidden Ability given its design but we can't have everything."
        },
        {
            "pokémon": "Bellibolt",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Kilowattrel",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Paldean Tauros",
            "sprite": "",
            "reason": "Game Freak kinda revealed a regional Tauros via a NPC's t-shirt during a trailer and I was excited for the prospect of one (but I took it with a pinch of salt). When it came out, I knew I had to use it in my playthrough. I'd fallen in love with Tauros in Sword/Shield as an alternative Intimidater. It was super fast (base 110 Speed) and was good for proccing Weakness Policies with Bulldoze or Surf (although I haven't used that yet). It's a shame the shiny isn't more distinct."
        },
        {
            "pokémon": "Brambleghast",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Scovillain",
            "sprite": "",
            "reason": "I prayed for a Grass/Fire type and envisaged a burning bush Tangela. Instead, I got a walking chili pepper with two heads and I love this damn thing. The typing works really well into the core types."
        },
        {
            "pokémon": "Rabsca",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Tinkaton",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Wugtrio",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Palafin",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Orthworm",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Glimmora",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Flamigo",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Cetitan",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Dudunsparce",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Kingambit",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Flutter Mane",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Iron Jugulis",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Iron Moth",
            "sprite": "",
            "reason": ""
        },
        {
            "pokémon": "Gholdengo",
            "sprite": "",
            "reason": "For a start, it looks like the Cheese String mascot which is cool on its own. Lots of nostalgia there. But then it also has a golden surfboard which adds even more cool points. Competitively, it's a beast with a huge Special Attack stat and that means I can use it to AFK the Ace Tournament (for the most part; it's not perfect). People hate it for some reason but I love this thing."
        }
    ]
}