[{"title":"Ambipom nicknames","description":"A list of Ambipom nicknames, their origins, and why I think they're cool.","slug":"ambipom"},{"title":"Annihilape nicknames","description":"A list of Annihilape nicknames, their origins, and why I think they're cool.","slug":"annihilape"},{"title":"Archaludon nicknames","description":"A list of Archaludon nicknames, their origins, and why I think they're cool.","slug":"archaludon"},{"title":"Ariados nicknames","description":"A list of Ariados nicknames, their origins, and why I think they're cool.","slug":"ariados"},{"title":"Beautifly nicknames","description":"A list of Beautifly nicknames, their origins, and why I think they're cool.","slug":"beautifly"},{"title":"Bellibolt nicknames","description":"A list of Bellibolt nicknames, their origins, and why I think they're cool.","slug":"bellibolt"},{"title":"Blastoise nicknames","description":"A list of Blastoise nicknames, their origins, and why I think they're cool.","slug":"blastoise"},{"title":"Centiskorch nicknames","description":"A list of Centiskorch nicknames, their origins, and why I think they're cool.","slug":"centiskorch"},{"title":"Deoxys nicknames","description":"A list of Deoxys nicknames, their origins, and why I think they're cool.","slug":"deoxys"},{"title":"Dipplin nicknames","description":"A list of Dipplin nicknames, their origins, and why I think they're cool.","slug":"dipplin"},{"title":"Feraligatr nicknames","description":"A list of Feraligatr nicknames, their origins, and why I think they're cool.","slug":"feraligatr"},{"title":"Ferrothorn nicknames","description":"A list of Ferrothorn nicknames, their origins, and why I think they're cool.","slug":"ferrothorn"},{"title":"Fezandipiti nicknames","description":"A list of Fezandipiti nicknames, their origins, and why I think they're cool.","slug":"fezandipiti"},{"title":"Gouging Fire nicknames","description":"A list of Gouging Fire nicknames, their origins, and why I think they're cool.","slug":"gouging-fire"},{"title":"Hydrapple nicknames","description":"A list of Hydrapple nicknames, their origins, and why I think they're cool.","slug":"hydrapple"},{"title":"Ice Rider Calyrex nicknames","description":"A list of Ice Rider Calyrex nicknames, their origins, and why I think they're cool.","slug":"ice-rider-calyrex"},{"title":"Incineroar nicknames","description":"A list of Incineroar nicknames, their origins, and why I think they're cool.","slug":"incineroar"},{"title":"Iron Boulder nicknames","description":"A list of Iron Boulder nicknames, their origins, and why I think they're cool.","slug":"iron-boulder"},{"title":"Iron Crown nicknames","description":"A list of Iron Crown nicknames, their origins, and why I think they're cool.","slug":"iron-crown"},{"title":"Iron Moth nicknames","description":"A list of Iron Moth nicknames, their origins, and why I think they're cool.","slug":"iron-moth"},{"title":"Jellicent nicknames","description":"A list of Jellicent nicknames, their origins, and why I think they're cool.","slug":"jellicent"},{"title":"Kingdra nicknames","description":"A list of Kingdra nicknames, their origins, and why I think they're cool.","slug":"kingdra"},{"title":"Magmortar nicknames","description":"A list of Magmortar nicknames, their origins, and why I think they're cool.","slug":"magmortar"},{"title":"Metagross nicknames","description":"A list of Metagross nicknames, their origins, and why I think they're cool.","slug":"metagross"},{"title":"Mewtwo nicknames","description":"A list of Mewtwo nicknames, their origins, and why I think they're cool.","slug":"mewtwo"},{"title":"Mimikyu nicknames","description":"A list of Mimikyu nicknames, their origins, and why I think they're cool.","slug":"mimikyu"},{"title":"Ogerpon nicknames","description":"A list of Ogerpon nicknames, their origins, and why I think they're cool.","slug":"ogerpon"},{"title":"Pecharunt nicknames","description":"A list of Pecharunt nicknames, their origins, and why I think they're cool.","slug":"pecharunt"},{"title":"Quaquaval nicknames","description":"A list of Quaquaval nicknames, their origins, and why I think they're cool.","slug":"quaquaval"},{"title":"Raging Bolt nicknames","description":"A list of Raging Bolt nicknames, their origins, and why I think they're cool.","slug":"raging-bolt"},{"title":"Raichu nicknames","description":"A list of Raichu nicknames, their origins, and why I think they're cool.","slug":"raichu"},{"title":"Scolipede nicknames","description":"A list of Scolipede nicknames, their origins, and why I think they're cool.","slug":"scolipede"},{"title":"Shadow Rider Calyrex nicknames","description":"A list of Shadow Rider Calyrex nicknames, their origins, and why I think they're cool.","slug":"shadow-rider-calyrex"},{"title":"Snorlax nicknames","description":"A list of Snorlax nicknames, their origins, and why I think they're cool.","slug":"snorlax"},{"title":"Stoutland nicknames","description":"A list of Stoutland nicknames, their origins, and why I think they're cool.","slug":"stoutland"},{"title":"Terapagos nicknames","description":"A list of Terapagos nicknames, their origins, and why I think they're cool.","slug":"terapagos"},{"title":"Breath of Fire nicknames","description":"A list of nicknames inspired by Breath of Fire that I think would work well with Pokémon.","slug":"themes/breath-of-fire"},{"title":"Fire type nicknames","description":"A list of nicknames inspired by fire that I think would work well with Pokémon.","slug":"themes/fire-type"},{"title":"Golden Sun nicknames","description":"A list of nicknames inspired by Golden Sun that I think would work well with Pokémon.","slug":"themes/golden-sun"},{"title":"Ice type nicknames","description":"A list of nicknames inspired by ice that I think would work well with Pokémon.","slug":"themes/ice-type"},{"title":"The Legend of Zelda nicknames","description":"A list of nicknames inspired by The Legend of Zelda that I think would work well with Pokémon.","slug":"themes/legend-of-zelda"},{"title":"Rivals of Aether nicknames","description":"A list of nicknames inspired by Rivals of Aether that I think would work well with Pokémon.","slug":"themes/rivals-of-aether"},{"title":"Tarot nicknames","description":"A list of nicknames inspired by tarot cards that I think would work well with Pokémon.","slug":"themes/tarot-cards"},{"title":"Tyranitar nicknames","description":"A list of Tyranitar nicknames, their origins, and why I think they're cool.","slug":"tyranitar"},{"title":"Walking Wake nicknames","description":"A list of Walking Wake nicknames, their origins, and why I think they're cool.","slug":"walking-wake"},{"title":"Yanma nicknames","description":"A list of Yanma nicknames, their origins, and why I think they're cool.","slug":"yanma"}]